[
    {
      "res_id": "14523",
      "role": "Other (Please provide details in candidate core skills)",
      "skills": [
        "Experience setting up Google Workspace- charity have joined but not started setting up. Needing word, spreed sheets, images, films etc to be able to be stored. Needing new emails set up as currently paying Wix for them"
      ],
      "hours": "2-3",
      "required": "1 person",
      "buddying": true,
      "it_key": "IT-471",
      "type": "External Project",
      "name": "Articulate Cultural Trust - Project scope ",
      "client": "Articulate Cultural Trust",
      "description": "Articulate’s strategy map, has five pillars for our future focus and attention: • the arts and creativity as a connector between culture and care • awareness and advocacy, including care experienced children’s rights to the arts and culture • places and spaces, including digital, where the ability to flourish and thrive is cultivated • child growth and development, including physical and mental well-being being nurtured • skills and workforce development for young people, teachers, social workers and artists. At the start of the lockdown Articulate was able to quickly move into the digital sphere, maintaining contact and evolving different perspectives on our projects and services as each day went past. However, that shift has meant that, at a critical time in our organisational development, we have had to take our eye off the ball in the delivery of our new five-year strategy. Though we agreed the right ‘here and now’ strategy was to act fast and do whatever it took to stay in touch with our most vulnerable young people this has meant delaying tasks that influence how we want to develop as a national charity at the crossroads between creativity and care. The upside of the situation is that we are experiencing committed engagement, dynamic and useful relationship-building with a far greater number of enquiries and young people from further afield than pre-pandemic lockdown. New young people join us daily to keep busy, alleviate stress and anxiety and take part in purposeful, collaborative and creative activity: https://us20.campaign-archive.com/?u=79b2b162625613dc8ac5a2552&id=6e8d032183 https://us20.campaign-archive.com/?u=79b2b162625613dc8ac5a2552&id=9ba045106d Can you help us get our narrative sorted and create a medium to longer term promotional campaign for national and local authorities, educators and social workers? We have so much good news to share and need your support to make sure this moment helps us consolidate and grow. Or just help us with getting the team all set up on Microsoft and making the most of the non-profit supports from people like Google etc. Thanks ever so much. Eona Craig - Articulate Cultural Trust - www.articulatehub.com",
      "video": "",
      "scope": "",
      "video_file": ""
    },
    {
      "res_id": "15486",
      "role": "Web Developer",
      "skills": [
        "Web Database Design and Build,",
        "Web Front End /UI Design and Build",
        "Web email integration",
        "Familiarity with userid/password maintenance"
      ],
      "hours": "10 Days",
      "required": "1 person",
      "buddying": true,
      "it_key": "IT-347",
      "type": "Design and Build",
      "name": "Carers of East Lothian website help",
      "client": "Carers of East Lothian",
      "description": "I have got an idea that would help unpaid carers to find professional help with their caring situation. It needs a bit of tech-ing though. Julie.",
      "video": "",
      "scope": "",
      "video_file": ""
    },
    {
      "res_id": "15065",
      "role": "Mobile Developer",
      "skills": [
        "Lead Devepment"
      ],
      "hours": "7-10 hours a week",
      "required": "1 person",
      "buddying": true,
      "it_key": "IT-470",
      "type": "Internal STA project",
      "name": "STA Volunteer App",
      "client": "Scottish Tech Army",
      "description": "We need an app!!! We currently face the following challenges 1 - We cannot tell who is looking for opportunities, happy to participate internally, on a break, has retired from the army. 2 - Data on skills - what you have and what you want to learn is in multiple places 3 - its not easy to see what STA internal events are coming up 4 - its not easy to see how active a volunteer is. We would like to recognise the contribution that people make.",
      "video": "",
      "scope": "",
      "video_file": ""
    },
    {
      "res_id": "15389",
      "role": "Web Development - Wordpress",
      "skills": [
        "Curiousity, Wordpress, web development"
      ],
      "hours": "4-8 hours",
      "required": "1 person",
      "buddying": true,
      "it_key": "IT-573",
      "type": "Charity",
      "name": "Hillfoot tales - website development",
      "client": "Hillfoots Tales",
      "description": "Hillfoots Tales (https://www.facebook.com/hillfootstales/) is a storytelling organisation in Clackmannanshire. They run storytelling events for certain demographics in their community and they need some guidance and help with developing a website. They are run by a small group of volunteers and had plans for a website but the person working on it has been side-tracked with personal issues. Danielle Gordon, Development Support Officer for the Creative Communities Fund at Inspiring Scotland has helped them map out what the key pages are they may require. They need to be able to update an events page regularly and Danielle suggests that she can definitely help with what a wireframe may look like.",
      "video": "",
      "scope": "",
      "video_file": ""
    },
    {
      "res_id": "14831",
      "role": "Marketing",
      "skills": [
        "Digital marketing and advertising online"
      ],
      "hours": "4-6 hours a week",
      "required": "1 person",
      "it_key": "IT-446",
      "type": "External Project",
      "name": "Downwindable.com marketing and advertising online",
      "client": "Downwindable.com",
      "description": "Hi, I created a website relating to the sport I'm involved in. The idea came as a result of the pandemic and not being able to compete nationally or internationally. I decided I wanted to create a database of 'downwind runs' (this is an A - B course at sea) around the UK that I could paddle over the next couple of years. I asked for routes on a few social media groups I'm in and it's snowballed into me creating this website. Still thinking it's just a personal project I didn't expect the response after putting out there. It's gone global and I'm on the back foot as I don't have experience in marketing and advertising online (ie what to charge, contracts, copyright etc). In addition I create each page for each run and also populate the map. It takes me on avg 3 hours to upload 10 runs. I had 27 to do yesterday. I love it, it's a massive learning curve on so many levels. I'm passionate about my sport and have done a lot over the last few years to grow the sport in Scotland, particularly getting women on the water. I made the GB Team in 2019 and competed at World Champs in France for the first time finishing 22. I'm no spring chicken and if I can do it anyone can. Anyway I need help with the tech, legal and marketing side of this venture.",
      "video": "",
      "buddying": false,
      "scope": "",
      "video_file": ""
    },
    {
      "res_id": "15530",
      "skills": [
        "WordPress development. Needs experience."
      ],
      "required": "1 person",
      "it_key": "IT-602",
      "name": "Mellow Parenting - Website bug and app bug",
      "client": "Mellow Parenting",
      "description": "We have a couple of problems! Firstly, we were introduced to you by Inspiring Scotland, as we are a small grant holder through the perinatal infant mental health fund, and we know they have referred a few other grant holders to you. Ok - so - what do we need help with? REQUIREMENT A: Our website. Its new, on Wordpress, but the developer did not finalise a section for us and it is hindering people accessing resources from our website. this is not good for us. REQUIREMENT B: Secondly, we have had an app designed to record live parent/child interaction so that we can view the interaction and report back to the parent in a strength based manner. This improves attachment and relationships between baby/child and parent. It is stored on our server, but we cant get the app developer to get the right software for it to go live. We do have a small sum of money to support this activity. REQUIREMENT C: Last, but not least - we need creative input into designing leaflets and campaigns etc. Im sorry to ask for so much, but I would be so grateful if you could consider one or all of them :) many thanks and best wishes Rosemary",
      "type": "",
      "role": "",
      "video": "",
      "hours": "",
      "buddying": false,
      "scope": "",
      "video_file": ""
    },
    {
      "res_id": "14701",
      "role": "Other (Please provide details in candidate core skills)",
      "skills": [
        "Website revamp - Looking for help with the website not showing on search engine on google. Help with boosting their website presence Making the website easy to navigate with optimized SEO",
        "Great knowledge of SEO"
      ],
      "hours": "3 days",
      "required": "1 person",
      "buddying": true,
      "it_key": "IT-511",
      "type": "External Project",
      "name": "Datakirk Website",
      "client": "Datakirk SCIO",
      "description": "Datakirk is an award winning charity providing data literacy and analytics training.We are empowering people with the skills for the jobs of tomorrow. We have built a Community of data enthusiasts and closing both the divide and attainment gaps. Datakirk represent diversity and a vehicle driving data literacy to the grassroots. A partner with Scottich tech army will increase our capacity and help us to achieve our goals of ensuring that every Community and families in Scotland are represented in the Datakirk economy. We would be happy to meet with your team. For more information info@thedatakirk.org.uk, @Tdatakirk www.thedatakirk.org.uk.",
      "video": "https://vimeo.com/666927571",
      "scope": "",
      "video_file": ""
    },
    {
      "res_id": "15512",
      "role": "Solution Architect",
      "skills": [
        "Solutions review and digital consultancy"
      ],
      "required": "1 person",
      "buddying": true,
      "it_key": "IT-588",
      "name": "Grand Bequest - Architecture Review",
      "client": "Grand Bequest",
      "description": "We need help with our data architecture and cleaning up some confusing Microsoft Azure infrastructure that was set up by a previous team member to get us on the right path forward again. We are looking for help from someone with database experience that can walk me (a non-technical founder) through what went wrong, what next steps we need to take, and set my expectations around budget and timeline appropriately. Thank you!",
      "type": "",
      "video": "",
      "hours": "",
      "scope": "",
      "video_file": ""
    },
    {
      "res_id": "14933",
      "role": "Other (Please provide details in candidate core skills)",
      "skills": [
        "Scrum Master - Agile Practices, ideally 1-3 years experience, if at all possible."
      ],
      "hours": "5-7 hours per week",
      "required": "1 person",
      "buddying": true,
      "it_key": "IT-603",
      "type": "Internal STA project",
      "name": "STA Products - Building a Demo system",
      "client": "Scottish Tech Army",
      "description": "We need a demo system for Odoo to understand and demonstrate the capabilities of the platform.",
      "video": "",
      "scope": "",
      "video_file": ""
    },
    {
      "res_id": "15534",
      "role": "App developer",
      "skills": [
        "App developer skills, including PHP. The The app was developed in PHP using Laravel 6 Framework and a MYSQL database engine. The volunteer would ideally work with the original app developer and the database server company to resolve the issue quickly. Alternately the developer can work directly on the code."
      ],
      "required": "1 person",
      "it_key": "IT-602",
      "name": "Mellow Parenting - Website bug and app bug",
      "client": "Mellow Parenting",
      "description": "We have a couple of problems! Firstly, we were introduced to you by Inspiring Scotland, as we are a small grant holder through the perinatal infant mental health fund, and we know they have referred a few other grant holders to you. Ok - so - what do we need help with? REQUIREMENT A: Our website. Its new, on Wordpress, but the developer did not finalise a section for us and it is hindering people accessing resources from our website. this is not good for us. REQUIREMENT B: Secondly, we have had an app designed to record live parent/child interaction so that we can view the interaction and report back to the parent in a strength based manner. This improves attachment and relationships between baby/child and parent. It is stored on our server, but we cant get the app developer to get the right software for it to go live. We do have a small sum of money to support this activity. REQUIREMENT C: Last, but not least - we need creative input into designing leaflets and campaigns etc. Im sorry to ask for so much, but I would be so grateful if you could consider one or all of them :) many thanks and best wishes Rosemary",
      "type": "",
      "video": "",
      "hours": "",
      "buddying": false,
      "scope": "",
      "video_file": ""
    },
    {
      "res_id": "15374",
      "role": "Developer",
      "skills": [
        "Odoo skills and curiosity. Curiosity about ecommerce and self-starter"
      ],
      "hours": "4-8 hours",
      "required": "1 person",
      "buddying": true,
      "it_key": "IT-582",
      "type": "Internal",
      "name": "STA Products - Building a LMS system",
      "client": "Scottish Tech Army",
      "description": "We need a demo system for Odoo to understand and demonstrate the capabilities of the platform.",
      "video": "",
      "scope": "",
      "video_file": ""
    },
    {
      "res_id": "15291",
      "role": "Business Analyst",
      "skills": [
        "Mapping of current state, analysis and problem statement"
      ],
      "hours": "4-8 hours a week",
      "required": "1 person",
      "buddying": true,
      "it_key": "IT-540",
      "type": "External",
      "name": "NHS Lothian - A&E Inventory Management",
      "client": "NHS Lothian (Emergency Dept/A&E)",
      "description": "I haven't checked with the powers that be about whether we could go forward with this idea so I'm just scouting out whether it would be something you'd be interested in. I work in the Emergency Department (A&E). In our resus rooms where our sickest patients go, we have boxes that contain all the equipment that we need to do emergency procedures. At the moment, we use paper checklists to stock these boxes. Because we're so busy, staff who don't routinely use the equipment are needing to stock the boxes and the wrong kit is ending up in them which isn't ideal in an emergency. An electronic web app solution would hopefully mean that we could: 1) have links to the individual items with descriptions, photos and locations to increase the speed and accuracy of stocking 2) track which individual boxes were missing items from a central point so our housekeepers know we need to order stock 3) track who's stocking the boxes so we can target education if there's recurrent mistakes in stocking 4) stop running out of copies of the paper checklists (and killing lots of trees) 5) update the checklists for all that type of box simultaneously giving us more control over versions when things need updated quickly. I've had a look online and can't find any opensource stock management type software that would fit the bill. I think the tech side would be relatively straightforward - I've drawn some diagrams and possible database structures to clarify my thinking but my HTML and PHP knowledge are a lot of versions out of date and if I tried to do it it would be ugly and clunky at best!! I think it would be useful to other areas too",
      "video": "",
      "scope": "",
      "video_file": ""
    },
    {
      "res_id": "15284",
      "role": "Web developer",
      "hours": "6 hours a week.",
      "required": "1 person",
      "buddying": true,
      "it_key": "IT-340",
      "type": "External",
      "name": "Ski Centre Support - Ayr",
      "client": "Newmilns Snow & Sports Complex",
      "description": "We are a charity ski slope based in Ayrshire. We are a volunteer led, community run social enterprise organisation who use snow sports as a mechanism for positive health, well-being, and social change in our local community. Due to Covid-19 we have decreased custom but treble the admin with confirmation emails (with Covid-19 related information), bookings (half the capacity and double staff) and online payments. We would love some help to automate our confirmation emails or add a basic booking system to our website and use the staff time to make more people available at busy times. Any help or advice would be much appreciated. Thank you, Stevi",
      "video": "",
      "skills": [],
      "scope": "",
      "video_file": ""
    },
    {
      "res_id": "15282",
      "role": "Project Manager",
      "skills": [
        "Project management, breaking the work down and ensuring that the correct volunteers are identified"
      ],
      "hours": "4 hours a week",
      "required": "1 person",
      "buddying": true,
      "it_key": "IT-517",
      "type": "Internal",
      "name": "STA Impact Programme",
      "client": "Scottish Tech Army",
      "description": "Key Question - How do we track the digitisation of the third sector? and the STA impact…. from an organisation view and the individual ",
      "video": "",
      "scope": "https://drive.google.com/file/d/1j469c-xp8HPYLocTgz5lMYHnnz7TsRVP/view?usp=sharing",
      "video_file": ""
    }
  ]
